{
  "architectures": [
    "GrouterMHA"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "multi_head_attn.GrouterMHAConfig",
    "AutoModel": "multi_head_attn.GrouterModel"
  },
  "bos_token_id": 100000,
  "eos_token_id": 100001,
  "pad_token_id": 100001,
  "first_k_dense_replace": 3,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 5472,
  "max_position_embeddings": 4096,
  "model_type": "grouter",
  "norm_topk_prob": false,
  "num_attention_heads": 8,
  "num_hidden_layers": 3,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000,
  "scoring_func": "softmax",
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.0",
  "use_cache": true,
  "vocab_size": 102400,
  "num_labels": 64,
  "no_pos_info": false,
  "use_encoder": true
}
