{
  "architectures": [
    "GrouterMLA"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "multi_latent_attn.GrouterConfig",
    "AutoModel": "multi_latent_attn.GrouterModel"
  },
  "bos_token_id": 100000,
  "eos_token_id": 100001,
  "pad_token_id": 100001,
  "first_k_dense_replace": 3,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 5472,
  "kv_lora_rank": 512,
  "max_position_embeddings": 163840,
  "model_type": "grouter",
  "n_group": 1,
  "n_routed_experts": 64,
  "norm_topk_prob": false,
  "num_attention_heads": 8,
  "num_experts_per_tok": 6,
  "num_hidden_layers": 3,
  "num_key_value_heads": 8,
  "num_nextn_predict_layers": 0,
  "q_lora_rank": 512,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000,
  "routed_scaling_factor": 2.5,
  "scoring_func": "sigmoid",
  "tie_word_embeddings": false,
  "topk_group": 4,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.3",
  "use_cache": true,
  "v_head_dim": 128,
  "vocab_size": 102400,
  "num_labels": 64,
  "no_pos_info": false,
  "use_encoder": false
}
