{
  "architectures": [
    "GrouterMHA"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "multi_head_attn.GrouterMHAConfig",
    "AutoModel": "multi_head_attn.GrouterModel"
  },
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "pad_token_id": 151645,
  "first_k_dense_replace": 3,
  "hidden_act": "silu",
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 2736,
  "max_position_embeddings": 40960,
  "model_type": "grouter",
  "norm_topk_prob": false,
  "num_attention_heads": 8,
  "num_hidden_layers": 3,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "scoring_func": "softmax",
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.0",
  "use_cache": false,
  "vocab_size": 151936,
  "num_labels": 256,
  "no_pos_info": false,
  "use_encoder": true
}
